# date: 17/12/2023
# context for question-answering model AI

context1 = """Курс Программная инженерия
Преподаватель курса Токарев Александр Владимирович
Длительность курса 5 недель.
Прохождение курса предусмотрено в группе. Наша группа 2.11. 
Состоит из следующих студентов Sheshin N.A., Perevispa O.V., Ivanov S.A., Ovchar E.A.
По результатам прохождения курса необходимо сдать итоговый проект. Итоговый проект – это практическая работа, 
которая оценивается в 50 баллов. Аттестация по дисциплине проходит в виде зачета. 
Зачет по дисциплине ставится при наборе от 40 баллов. Всего возможно получить 100баллов.
Выполнение практических заданий на платформе для текущей аттестации по курсу оценивается в 100 баллов.
Курс проходит в 1 семестре.
Целью освоения дисциплины «Программная инженерия» является понимание процессов командной разработки. 
В ходе обучения студенты узнают о различных методологиях разработки, процессе создания программного продукта и 
отличии программной инженерии от других областей, а также научатся использовать профессиональные термины 
и получат представление о специфике профессии.
В результате освоения курса студенты смогут разрабатывать компоненты программно-аппаратных комплексов обработки 
информации и автоматизированного проектирования

Студенты будут уметь:
- формулировать инженерные задачи с учетом формализованных требований
- выбирать оборудование и технологическую оснастку при разработке технических заданий на проектирование и изготовление 
инженерных продуктов и технических объектов;
- выбирать языки программирования для написания программного кода с учетом технического задания
- проводить всесторонний анализ принятых инженерных решений для выполнения разработки технических объектов, систем, 
в том числе информационных, и технологических процессов.
Структура курса: программная инженерия для приложений искусственного интеллекта, архитектура приложений, 
разработка API для приложений искусственного интеллекта, развертывание приложений искусственного интеллекта в облаке, 
тестирование программного обеспечения.
В разработке скрипта на API будет использоваться библиотека python FastAPI. Сервер приложения uvicorn.
Для разработки web-приложения будет использовать библиотека streamlit.
Тестирование приложений будет построено на технологии Continuous Integration с помощью встроенных в GitHub actions. 
Также для тестирования приложений используется библиотека pytest.
Развертывание приложения приведено на примере создания виртуального сервера в Yandex.Cloud. 

"""